Reservation1/app/views/rooms/index.html.erb

</table>
<p>合計収容人数: <%= Room.sum(:number) %>人</p>
<p>平均収容人数: <%= Room.average(:number).to_f %>人</p>
---
SELECT "rooms".* FROM "rooms"
SELECT SUM("rooms"."number") FROM "rooms"
SELECT AVG("rooms"."number") FROM "rooms"