Reservation/app/views/rooms/show.html.erb

SELECT "entries".* FROM "entries" WHERE "entries"."room_id" = ?  [["room_id", 13]]
---

<% @room.entries.each do |ent| %>