Reservation/app/controllers/auths_controller.rb

  def create
    user = User.find_by(email: params[:auth][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]