Reservation/app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)
    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("reserved_date", "usage_time", "room_id", "people", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reserved_date", "2022-03-15 12:55:00"], ["usage_time", 3.0], ["room_id", 1], ["people", 20], ["created_at", "2022-03-15 03:26:40.772501"], ["updated_at", "2022-03-15 03:26:40.772501"]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 7]]

  def set_entry
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]