Reservation/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "place", "number", "created_at", "updated_at", "terms_of_use") VALUES (?, ?, ?, ?, ?, ?)  [["name", "SouthernWish #10"], ["place", "東京"], ["number", 10], ["created_at", "2022-05-20 08:57:41.664644"], ["updated_at", "2022-05-20 08:57:41.664644"], ["terms_of_use", "仕事"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "updated_at" = ? WHERE "rooms"."id" = ?  [["updated_at", "2022-05-20 08:58:01.916560"], ["id", 72]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 9]]
---
  def destroy
    @room.destroy